/* File:    drvSIS3820.c
 * Author:  Wayne Lewis
 * Date:    15-feb-2006
 *
 * Description:
 * This is the driver support routine for the SIS3820 multiscaler.
 * It is based heavily on the driver support for the STR7201 written by
 * Mark Rivers.
 */

/*
 * Modification Log:
 * -----------------
 * .01  16-feb-06 wkl   Initial migration to SIS3820
 * .02  17-mar-06 wkl   Add options to set input and output modes
 * .03  17-mar-06 wkl   Fix up preset counting support.
 */


/************/
/* Includes */
/************/

/* System includes */
#include	<stdio.h>
#include	<stdlib.h>

/*#include	<sys/types.h>*/	/*we can use epicsTypes.h instead for more OS independence */
#ifdef vxWorks
#include	<fppLib.h>
#endif

/* EPICS includes */
#include	<alarm.h>
#include	<callback.h>
#include	<dbDefs.h>
#include	<dbAccess.h>
#include	<recSup.h>
#include  <epicsExport.h>
#include	<devSup.h>
#include	<devLib.h>
#include	<link.h>
#include	<epicsTypes.h>

/* Custom includes */
#include	"sis3820.h"
#include	"drvSIS3820.h"
#include	"devScaler.h"
#include	"devScalerSIS3820.h"

/***************/
/* Definitions */
/***************/

/* Define macros to interlock access to card, including interrupts */
# define INTERLOCK_ON \
         {epicsMutexLock(p->lock); \
          p->address->irq_control_status_reg = SIS3820_IRQ_SOURCE2_DISABLE;}

# define INTERLOCK_OFF \
         {p->address->irq_control_status_reg = SIS3820_IRQ_SOURCE2_ENABLE; \
          epicsMutexUnlock(p->lock);}

/* Debug support */
#define Debug(l,FMT,V...) {if (l <= drvSIS3820Debug) \
			  { printf("%s(%d):",__FILE__,__LINE__); \
                            printf(FMT,## V);}}

volatile int drvSIS3820Debug = 0;
epicsExportAddress(int, drvSIS3820Debug);

/**************/
/* Structures */
/**************/

/* This structure duplicates the control and status register structure of the
 * SIS3820. Note that it does not extend to the FIFO/SDRAM area, as this would
 * chew a lot of memory. Access to the FIFO/SDRAM needs to be via an explicit
 * offset from the base address. FIFO address space is from 0x800000 to
 * 0xfffffc. 
 */
typedef volatile struct {
  epicsUInt32 control_status_reg;         /* Offset = 0x00 */
  epicsUInt32 moduleID_reg;               /* Offset = 0x04 */
  epicsUInt32 irq_config_reg;             /* Offset = 0x08 */
  epicsUInt32 irq_control_status_reg;     /* Offset = 0x0c */

  epicsUInt32 acq_preset_reg;             /* Offset = 0x10 */
  epicsUInt32 acq_count_reg;              /* Offset = 0x14 */
  epicsUInt32 lne_prescale_factor_reg;    /* Offset = 0x18 */
  epicsUInt32 unused1c;
  
  epicsUInt32 preset_group1_reg;          /* Offset = 0x20 */
  epicsUInt32 preset_group2_reg;          /* Offset = 0x24 */
  epicsUInt32 preset_enable_reg;          /* Offset = 0x28 */
  epicsUInt32 unused2c;

  epicsUInt32 cblt_setup_reg;             /* Offset = 0x30 */
  epicsUInt32 sdram_page_reg;             /* Offset = 0x34 */
  epicsUInt32 fifo_word_count_reg;        /* Offset = 0x38 */
  epicsUInt32 fifo_word_threshold_reg;    /* Offset = 0x3c */

  epicsUInt32 hiscal_start_preset_reg;    /* Offset = 0x40 */
  epicsUInt32 hiscal_start_counter_reg;   /* Offset = 0x44 */
  epicsUInt32 hiscal_last_acq_count_reg;  /* Offset = 0x48 */
  epicsUInt32 unused4c;

  epicsUInt32 unused50_fc[44];
  
  epicsUInt32 op_mode_reg;                /* Offset = 0x100 */
  epicsUInt32 copy_disable_reg;           /* Offset = 0x104 */
  epicsUInt32 lne_channel_select_reg;     /* Offset = 0x108 */
  epicsUInt32 preset_channel_select_reg;  /* Offset = 0x10c */

  epicsUInt32 unused110_1fc[60];
  
  epicsUInt32 count_disable_reg;          /* Offset = 0x200 */
  epicsUInt32 count_clear_reg;            /* Offset = 0x204 */
  epicsUInt32 counter_overflow_reg;       /* Offset = 0x208 */
  epicsUInt32 unused20c;

  epicsUInt32 ch1_17_high_bits_reg;       /* Offset = 0x210 */

  epicsUInt32 unused214_2fc[59];

  epicsUInt32 sdram_prom_reg;             /* Offset = 0x300 */
  epicsUInt32 unused304;
  epicsUInt32 unused308;
  epicsUInt32 unused30c;

  epicsUInt32 xilinx_test_data_reg;       /* Offset = 0x310 */
  epicsUInt32 xilinx_control;             /* Offset = 0x314 */

  epicsUInt32 unused318_3fc[58];

  epicsUInt32 key_reset_reg;              /* Offset = 0x400 */
  epicsUInt32 key_fifo_reset_reg;         /* Offset = 0x404 */
  epicsUInt32 key_test_pulse_reg;         /* Offset = 0x408 */
  epicsUInt32 key_counter_clear;          /* Offset = 0x40c */

  epicsUInt32 key_lne_clock_reg;          /* Offset = 0x410 */
  epicsUInt32 key_op_arm_reg;             /* Offset = 0x414 */
  epicsUInt32 key_op_enable_reg;          /* Offset = 0x418 */
  epicsUInt32 key_op_disable_reg;         /* Offset = 0x41c */

  epicsUInt32 unused420_4fc[56];
  
  epicsUInt32 unused500_7fc[192];

  epicsUInt32 shadow_regs[32];            /* Offset = 0x800 to 0x87c */
  epicsUInt32 unused880_8fc[32];

  epicsUInt32 unused900_9fc[64];

  epicsUInt32 counter_regs[32];           /* Offset = 0xa00 to 0xa7c */
  epicsUInt32 unuseda80_afc[32];

  epicsUInt32 unusedb00_ffc[320];         /* Unused space to 4KB per board */
} SIS3820_REGS;


static struct strCard {
  int exists;
  int moduleID;
  int firmwareVersion;
  SIS3820_REGS *address;
  int mode;
  int maxSignals;
  int maxChans;
  int nChans;
  int nextChan;
  int nextSignal;
  double presetTime;
  int startTime;
  double elapsedTime;
  double elapsedPrevious;
  int presetStartChan[SIS3820_MAX_SIGNALS];
  int presetEndChan[SIS3820_MAX_SIGNALS];
  long presetCounts[SIS3820_MAX_SIGNALS];
  long elapsedCounts[SIS3820_MAX_SIGNALS];
  int lneSource;
  int lnePrescale;
  int ch1RefEnable;
  int softAdvance;
  long *buffer;  /* maxSignals * maxChans */
  long *buffPtr;
  int acquiring;
#ifdef vxWorks
  FP_CONTEXT *pFpContext;
#endif
  epicsMutexId lock;
} *strCard=0;

/***********************/
/* Function prototypes */
/***********************/

